stm32-hotspot/ST67W6X_RTP_Multicast/FSBL/Core/Src/main.c
  /* Configure regions */
  /* R0: Uncached SRAM */
  region.AttributesIndex  = attr_not_cacheable;
  region.Number           = MPU_REGION_NUMBER0;
  region.Enable           = MPU_REGION_ENABLE;
  region.BaseAddress      = (uint32_t)&__uncached_bss_start__;
  region.LimitAddress     = (uint32_t)&__uncached_bss_end__ - 1;
  region.AccessPermission = MPU_REGION_ALL_RW;
  region.DisableExec      = MPU_INSTRUCTION_ACCESS_DISABLE;
  region.IsShareable      = MPU_ACCESS_NOT_SHAREABLE;
  HAL_MPU_ConfigRegion(&region);

  /* R1: FreeRTOS heap */
  region.AttributesIndex  = attr_not_cacheable;
  region.Number           = MPU_REGION_NUMBER1;
  region.Enable           = MPU_REGION_ENABLE;
  region.BaseAddress      = (uint32_t)&__freertos_heap_start__;
  region.LimitAddress     = (uint32_t)&__freertos_heap_end__ - 1;
  region.AccessPermission = MPU_REGION_ALL_RW;
  region.DisableExec      = MPU_INSTRUCTION_ACCESS_DISABLE;
  region.IsShareable      = MPU_ACCESS_NOT_SHAREABLE;
  HAL_MPU_ConfigRegion(&region);

  /* Enable MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

  /* Exit critical section */
  __set_PRIMASK(primask);
}

static void OTP_Config(void)
{
  BSEC_HandleTypeDef hbsec = { 0 };
  uint32_t fuse_id;
  uint32_t bit_mask;
  uint32_t data;
  int32_t  status = 0;

  /* Enable BSEC & SYSCFG clocks to ensure BSEC data accesses */
  __HAL_RCC_BSEC_CLK_ENABLE();
  __HAL_RCC_SYSCFG_CLK_ENABLE();

  /* Read current value of fuse */
  hbsec.Instance  = BSEC;
  fuse_id         = BSEC_HW_CONFIG_ID;
  status = HAL_BSEC_OTP_Read(&hbsec, fuse_id, &data);
  if (status != HAL_OK)
  {
    /* Error : Fuse read unsuccessful */
    Error_Handler();
  }

  /* Check if fuse is already programmed */
  bit_mask = BSEC_HWS_HSLV_VDDIO3 | BSEC_HWS_HSLV_VDDIO2;
  if ((data & bit_mask) != bit_mask)
  {
    data |= bit_mask;

    /* Bitwise programming of lower bits */
    status = HAL_BSEC_OTP_Program(&hbsec, fuse_id, data, HAL_BSEC_NORMAL_PROG);
    if (status != HAL_OK)
    {
      /* Error : Fuse programming unsuccessful */
      Error_Handler();
    }

    /* Read lower bits to verify the correct programming */
    status = HAL_BSEC_OTP_Read(&hbsec, fuse_id, &data);
    if (status != HAL_OK)
    {
      /* Error : Fuse read unsuccessful */
      Error_Handler();
    }

    /* Check if fuse programming was successful */
    if ((data & bit_mask) != bit_mask)
    {
      /* Error : Fuse programming not taken in account */
      Error_Handler();
    }
  }
}

static void PeripheralClock_Config(void)
{
  RCC_PeriphCLKInitTypeDef  config = { 0 };
  int32_t                   status;

  /* Configure peripheral clocks */
  /* XSPI1 = HCLK = 200MHz */
  config.PeriphClockSelection |= RCC_PERIPHCLK_XSPI1;
  config.Xspi1ClockSelection = RCC_XSPI1CLKSOURCE_HCLK;

  /* XSPI2 = HCLK = 200MHz */
  config.PeriphClockSelection |= RCC_PERIPHCLK_XSPI2;
  config.Xspi2ClockSelection = RCC_XSPI2CLKSOURCE_HCLK;

  /* Apply configuration */
  status = HAL_RCCEx_PeriphCLKConfig(&config);
  if (status != HAL_OK)
  {
    Error_Handler();
  }
}

static void Power_Config(void)
{
  /* Ensure VDDCORE=0.9V before increasing the system frequency */
#if (STM32N6570_DK_REV == STM32N6570_DK_C01)
  BSP_SMPS_Init(SMPS_VOLTAGE_OVERDRIVE);
#else /* STM32N6570_DK_B01/STM32N6570_DK_A01/STM32N6570_DK_A03 */
  BSP_I2C2_Init();
  uint8_t tmp = 0x64;
  BSP_I2C2_WriteReg(0x49 << 1, 0x01, &tmp, 1);
  BSP_I2C2_DeInit();
  HAL_Delay(1); /* Assuming Voltage Ramp Speed of 1mV/us --> 100mV increase takes 100us */
#endif
}

/* USER CODE END 4 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1U)
  {
    BSP_LED_Toggle(LED_RED);
    HAL_Delay(100);
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
